bench/results/h1-sweep-20260427-050651/hyper-1m.h2load.txt
starting benchmark...
spawning thread #0: 20 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 20 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 20 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 20 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #3.
Warm-up started for thread #1.
Warm-up started for thread #2.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.01s, 9724.38 req/s, 9.50GB/s
requests: 77795 total, 77795 started, 77795 done, 77795 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 77795 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 75.98GB (81580271315) total, 4.49MB (4709232) headers (space savings 0.00%), 85.16GB (91444215808) data
                     min         max         mean         sd        +/- sd
time for request:      413us     27.17ms      8.23ms      2.78ms    71.65%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :     118.78      124.70      121.49        1.15    73.75%